In [1]:
import pandas as pd

In [2]:
CCTV_Seoul = pd.read_csv('data/seoul_in_cctv.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [3]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [4]:
CCTV_Seoul.columns[0]

'기관명'

In [5]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [10]:
pop_seoul=pd.read_excel('data/population_in_seoul.xls', encoding='utf-8')
pop_seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [12]:
# 엑셀 내용을 보면 4번째 줄부터 실데이터가 들어있음.
# 필요한 컬럼에 대해서만 데이터를 가져오면 되기 때문에 parse_cols 사용
pop_seoul=pd.read_excel('data/population_in_seoul.xls'
                        , header=2
                        , parse_cols='B,D,G,J,N'
                        , encoding='utf-8')
pop_seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [21]:
# 컬럼명 변경
pop_seoul.rename(columns={pop_seoul.columns[0]: '구별'
                         , pop_seoul.columns[1]: '인구수'
                         , pop_seoul.columns[2]: '한국인'
                         , pop_seoul.columns[3]: '외국인'
                         , pop_seoul.columns[4]: '고령자'}, inplace=True)
pop_seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [24]:
###################################
### 1-3 기초 익히기
###################################
import pandas as pd
import numpy as np


s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [25]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [29]:
# 6, 4 의 배열을 만들고 각 컬럼명을 A, B, C, D 로 지정.
# index(row) 는 위에서 지정한 dates 를 사용함
df=pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.026741  0.668853  1.095610 -0.609091
2013-01-02  0.560562  0.001855 -0.563265 -1.463109
2013-01-03  0.012630 -0.077385  0.152142 -0.396065
2013-01-04 -0.343585 -0.278706 -0.568727 -0.504070
2013-01-05 -1.211969  0.693822  1.356765  0.319200
2013-01-06  0.479107 -0.474511  0.639108 -0.814447

In [32]:
# head 안의 숫자는 보여줄 라인수를 지정. (기본 5행)
df.head(3)

                   A         B         C         D
2013-01-01 -0.026741  0.668853  1.095610 -0.609091
2013-01-02  0.560562  0.001855 -0.563265 -1.463109
2013-01-03  0.012630 -0.077385  0.152142 -0.396065

In [33]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [34]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [35]:
df.values

array([[-0.02674107,  0.66885292,  1.09561045, -0.60909081],
       [ 0.56056194,  0.00185522, -0.56326496, -1.4631088 ],
       [ 0.01262956, -0.07738507,  0.15214219, -0.39606478],
       [-0.34358536, -0.27870621, -0.56872661, -0.50406983],
       [-1.21196925,  0.69382165,  1.35676509,  0.31920004],
       [ 0.4791071 , -0.47451054,  0.63910757, -0.81444674]])

In [36]:
# DateFrame 의 정보를 알 수 있음.
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [37]:
# 통계적 개요를 확인
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.088333  0.088988  0.351939 -0.577930
std    0.645717  0.487867  0.821015  0.580315
min   -1.211969 -0.474511 -0.568727 -1.463109
25%   -0.264374 -0.228376 -0.384413 -0.763108
50%   -0.007056 -0.037765  0.395625 -0.556580
75%    0.362488  0.502103  0.981485 -0.423066
max    0.560562  0.693822  1.356765  0.319200

In [38]:
# B 를 기준으로 정렬. 내림차순
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-05 -1.211969  0.693822  1.356765  0.319200
2013-01-01 -0.026741  0.668853  1.095610 -0.609091
2013-01-02  0.560562  0.001855 -0.563265 -1.463109
2013-01-03  0.012630 -0.077385  0.152142 -0.396065
2013-01-04 -0.343585 -0.278706 -0.568727 -0.504070
2013-01-06  0.479107 -0.474511  0.639108 -0.814447

In [39]:
df['A']

2013-01-01   -0.026741
2013-01-02    0.560562
2013-01-03    0.012630
2013-01-04   -0.343585
2013-01-05   -1.211969
2013-01-06    0.479107
Freq: D, Name: A, dtype: float64

In [40]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.026741  0.668853  1.095610 -0.609091
2013-01-02  0.560562  0.001855 -0.563265 -1.463109
2013-01-03  0.012630 -0.077385  0.152142 -0.396065

In [41]:
# index 로 범위지정하여 조회
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.560562  0.001855 -0.563265 -1.463109
2013-01-03  0.012630 -0.077385  0.152142 -0.396065
2013-01-04 -0.343585 -0.278706 -0.568727 -0.504070

In [43]:
# 0번째 index를 row 단위로 보기
df.loc[dates[0]]

A   -0.026741
B    0.668853
C    1.095610
D   -0.609091
Name: 2013-01-01 00:00:00, dtype: float64